# DBeam_Begin

## Description
start drawing beam routine

```pascal
PROCEDURE DBeam_Begin;
```

```python
def vs.DBeam_Begin():
    return None
```

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight